package com.peka.massassistanttelegrambot.utils;

import lombok.experimental.UtilityClass;

/**
 * DESCRIPTION
 *
 * @author Vladislav_Karpeka
 * @version 1.0.0
 */
@UtilityClass
public class BotCommandsUtils {

  public String START_COMMAND_TEXT = """
      Привет, %s, приятно познакомиться! %s
      Я бот который считает твои калории и БЖУ. %s
      Для того, чтобы начать мною пользоваться можешь посмотреть меню или уже сразу начать подсчет калорий /calculate !
      """;

  public String CONFIG_ALL_COMMAND_TEXT = """
      Здесь можно настроить, как будут считаться калории и питательные вещества! %s
              
      Учесть процент жира под кожей - %s %s
      Сколько грамм белка на каждый килограмм веса тела - %.1f %s
      Сколько грамм жиров на каждый килограмм веса тела - %.1f %s
      """;

  public String CONFIG_LOCATION_COMMAND_TEXT = """
      Если ты хочешь использовать функцию отслеживания калорий,
      отправь свою текущую локацию %s. Я определю твой часовой пояс
      и буду следить за твоими калориями в течение 24 часов, отправляя результаты в 00:00.
              
      P.S. Обещаю сохранить только часовой пояс (например, Europe/London).
      Мне не интересно, где именно ты живешь!)
      """;

  public String SCHEDULER_COMMAND_TEXT = """
      Ты можешь включить или выключить автоматический подсчет калорий и уведомления о результатах за день %s
      Сейчас эта функция %s
      """;

  public String ADD_FOOD_COMMAND_TEXT = """
      Чтобы добавить продукты, которые ты съел, отправь мне сообщение в таком формате:
      Название продукта
      Белки %s
      Жиры %s
      Углеводы %s
              
      Пример:
      Омлет с овощами
      20.5
      15.2
      5.7
              
      Я рассчитаю калории на основе этой информации!
      """;

  public String CLEAR_FOOD_COMMAND_TEXT = """
      Ты уверен, что хочешь удалить всю информацию о съеденной еде? %s
      """;
}
