package com.peka.massassistanttelegrambot.utils;

import lombok.experimental.UtilityClass;

/**
 * DESCRIPTION
 *
 * @author Vladislav_Karpeka
 * @version 1.0.0
 */
@UtilityClass
public class BotCommandsUtils {

  public String START_COMMAND_TEXT = """
      Приветствую, %s! Рад познакомиться! %s
      Я - бот, который поможет тебе считать калории и контролировать питание. %s
      Если ты не знаком с понятиями калорий и БЖУ (белки, жиры, углеводы), не беспокойся! Я сделаю это простым для тебя.
          
      Вот что я могу:
      - Рассчитывать дневную норму калорий и БЖУ на основе твоих параметров. (/calculate)
      - Считать калории и БЖУ по еде, которую ты съел. (/add)
      - Вести учет избранной еды. (/liked_list)
      - Отправлять тебе дневные результаты калорий и БЖУ. (/result)
      - Помогать настроить процент подкожного жира для более точных расчетов. (/config)
      - Трекировать калории на основе твоей локации и времени. (/location)
      - Помогать настроить цель - поддерживать, набирать или терять вес. (/schedule)
          
      Для начала, можешь посмотреть меню команд или сразу начать расчет калорий - /calculate!
      Если у тебя есть вопросы, не стесняйся - пиши моему создателю @borecjudo.
      """;

  public String CONFIG_ALL_COMMAND_TEXT = """
      Здесь можно настроить, как будут считаться калории и питательные вещества! %s
              
      Учесть процент жира под кожей - %s %s
      Сколько грамм белка на каждый килограмм веса тела - %.1f %s
      Сколько грамм жиров на каждый килограмм веса тела - %.1f %s
      """;

  public String CONFIG_LOCATION_COMMAND_TEXT = """
      Если ты хочешь использовать функцию отслеживания калорий,
      отправь свою текущую локацию %s. Я определю твой часовой пояс
      и буду следить за твоими калориями в течение 24 часов, отправляя результаты в 00:00.
              
      P.S. Обещаю сохранить только часовой пояс (например, Europe/London).
      Мне не интересно, где именно ты живешь!)
            
      Или ты можешь отправить сообщение которое содержит твою локацию.
      Пример:
      Europe/London
      """;

  public String SCHEDULER_COMMAND_TEXT = """
      Ты можешь включить или выключить автоматический подсчет калорий и уведомления о результатах за день %s
      Сейчас эта функция %s
      """;

  public String ADD_FOOD_COMMAND_TEXT = """
      Чтобы добавить продукты, которые ты съел, отправь мне сообщение в таком формате:
      Название продукта
      Белки %s
      Жиры %s
      Углеводы %s
              
      Пример:
      Омлет с овощами
      20.5
      15.2
      5.7
              
      Я рассчитаю калории на основе этой информации!
      """;

  public String CLEAR_FOOD_COMMAND_TEXT = """
      Ты уверен, что хочешь удалить всю информацию о съеденной еде? %s
      """;

  public String SCHEDULED_CLEAR_FOOD_COMMAND_TEXT = """
      Каждодневное уведомление об очистке списка еды!
      Хочешь удалить всю информацию о съеденной еде? %s
      """;
}
